# Задание №3:
# Если взять строку - "237" и сложить все её числа то получится 2+3+7 = 12.
# Возьмите строку "4729461084" и сложите все её числа.
# Результат выведите на экран.

a = [2, 3, 7]
print(sum(a))
b = [4,7,2,9,4,6,1,0,8,4]
print(sum(b)) 

