# Задание 5:
# my_list = [2,4,6,8,10,1,3,5,7,9,11,13,17]
# Выведите все элементы списка с четными ИНДЕКСАМИ (то есть A[0], A[2], A[4], ... ])

my_list = [2,4,6,8,10,1,3,5,7,9,11,13,17]
for lis2 in range(0,len(my_list)):
    if lis2 % 2 == 0:
        print(my_list[lis2])
    
        
